lisp/clbe/clbe-7.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-09-04 Sat 22:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Data Types</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Ashok Khanna">
 <meta http-equiv="X-UA-Compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="preamble" class="status">
Love. Peace. Kindness
</div>
<div id="content">
<h1 class="title">Data Types</h1>
<p>
Previous: <a href="clbe-6.html">6. Blocks</a>
</p>

<p>
Next: <a href="clbe-8.html">8. Conditionals</a>
</p>

<p>
In the next two sections we will discuss conditionals and loops. To do
so effectively, we need first briefly discuss data types and how Lisp
handles boolean and logic.
</p>

<p>
As a reminder, it is important to note that in Lisp, data objects are
typed, not variables. Any variable can have any Lisp object as its
value.
</p>

<p>
Many Lisp objects belong to more than one type. The predicate TYPEP
returns whether an object belongs to a given type, and the function
TYPE-OF returns a type to which a given object belongs:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns true</span>

(typep <span style="color: #8b2252;">"My String"</span> 'string)


<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns (SIMPLE-ARRAY CHARACTER (9))</span>

(type-of <span style="color: #8b2252;">"My String"</span>)


</pre>
</div>
<p>
As we learn later, strings are an array of characters. Examples of Type
Predicate Functions include ATOM, NULL, ZEROP, NUMBERP, EVENP, LISTP,
ARRAYP, PLUSP, CHARACTERP, ODDP, SYMBOLP, PACKAGEP, MINUSP, STRINGP 
and ODDP.
</p>

<div id="outline-container-org7c6aef8" class="outline-2">
<h2 id="org7c6aef8">Boolean &amp; Logic</h2>
<div class="outline-text-2" id="text-org7c6aef8">
<p>
The built-in types form a hierarchy of subtypes and supertypes. The
symbol T (for truth) is the supertype of all types. We can express
truth with any object other than NIL, the symbol for false:
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Prints true</span>

(<span style="color: #a020f0;">if</span> 55 (print <span style="color: #8b2252;">"True"</span>) (print <span style="color: #8b2252;">"False"</span>))

</pre>
</div>

<p>
The function AND returns NIL if any of its arguments are false and
returns the value of the last argument if all arguments are true.  The
function OR returns the first argument that is true and NIL if no
argument is true.
</p>

<div class="org-src-container">
<pre class="src src-lisp">
<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 5</span>

(and t (+ 1 2) (* 1 5))

<span style="color: #b22222;">;; </span><span style="color: #b22222;">Returns 3</span>

(or nil (+ 1 2) (* 1 5))

</pre>
</div>
</div>
</div>

<div id="outline-container-org57d24c1" class="outline-2">
<h2 id="org57d24c1">Equality &amp; Comparison</h2>
<div class="outline-text-2" id="text-org57d24c1">
<p>
Common Lisp has a few different functions for testing equality of two
objects. Most beginners should use EQUAL for non-numbers and = for
numbers. EQ compares equality of memory addresses and is the fastest
test. It is useful to compare symbols quickly and to test whether two
cons cells are physically the same object. It should not be used to
compare numbers.
</p>

<p>
EQL is like EQ except that it can safely compare numbers for numerical
equality and type equality. It is the default equality test in many
Common Lisp functions.
</p>

<p>
EQUAL is a general purpose test that, in addition to being able to
safely compare numbers like EQL, can safely compare lists on an
element by element basis. Lists are not unique and EQ and EQL will
fail to return equality on equivalent lists if they are stored in
different memory addresses.
</p>

<p>
EQUALP is a more liberal version of EQUAL. It ignores case
distinctions in strings, among other things.
</p>

<p>
= is the most efficient way to compare numbers, and the only way to
compare numbers of disparate types, such as 3 and 3.0. It only accepts
numbers.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="Date">Last updated: 24 July 2021</p><script src="/scripts/main.js"></script>
</div>
</body>
</html>
